src/cf/Documents/СхемаЛеченияКонкретногоПациента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СхемаЛеченияКонкретногоПациента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РезультатЛечения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СостояниеЗдоровья</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЗдоровья</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЛечения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЛечения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СхемаЛечения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Препарат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дозировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/РезультатЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>РезультатЛечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЛечениеНеЗакончено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эффективное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неэффективное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/СхемаЛеченияКонкретногоПациента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СостояниеЗдоровьяПриИзменении(Элемент)
	
	Если ДатаЛеченияДействует() Тогда
		Если Объект.СостояниеЗдоровья = ПредопределенноеЗначение("Перечисление.СостояниеЗдоровья.Хорошее") ИЛИ
			Объект.СостояниеЗдоровья = ПредопределенноеЗначение("Перечисление.СостояниеЗдоровья.БезИзменений") Тогда 
			
			ПоказатьПредупреждение(, "Выбор невозможен");
			Объект.СостояниеЗдоровья = ПредопределенноеЗначение("Перечисление.СостояниеЗдоровья.ПустаяСсылка");  
			
		КонецЕсли;
	Иначе 
		Если ТипЗнч(ПереченьНегативныхСостоянийЗдоровья().Найти(Объект.СостояниеЗдоровья)) = Тип("Число")  Тогда
			Элементы.РезультатЛечения.СписокВыбора[1].Пометка = Истина;
		КонецЕсли;	
		УстановитьВидимостьРезультатаЛечения();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПереченьНегативныхСостоянийЗдоровья()
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.СостояниеЗдоровья.БезИзменений);
	Массив.Добавить(Перечисления.СостояниеЗдоровья.Плохое);
	Массив.Добавить(Перечисления.СостояниеЗдоровья.Критическое);
	
	Возврат Массив;
	
КонецФункции	

&НаСервере
Функция ДатаЛеченияДействует()
	Возврат КонецДня(Объект.Дата) + 86400*Объект.ДлительностьЛечения  > ТекущаяДата();
КонецФункции	

&НаСервере
Процедура УстановитьВидимостьРезультатаЛечения() 
	
	Если ДатаЛеченияДействует() Тогда
		Элементы.РезультатЛечения.Видимость = Истина;
		Объект.РезультатЛечения = Перечисления.РезультатЛечения.ЛечениеНеЗакончено;
	Иначе
		//Элементы.РезультатЛечения.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьРезультатаЛечения();
	
КонецПроцедуры
